{
  "title": "3M_2022_10K",
  "children": [
    {
      "title": "PART I",
      "children": [
        {
          "title": "Item 1: Business",
          "children": [],
          "start_page": 4,
          "end_page": 9,
          "summary": "3M Company, incorporated in 1929 and traded under ticker MMM, is a diversified global technology company organized into four reportable business segments: Safety and Industrial, Transportation and Electronics, Health Care, and Consumer. In July 2022, 3M announced plans to spin off its Health Care business as a separate public company, signaling a strategic portfolio restructuring.",
          "node_id": "part_i_item_1"
        },
        {
          "title": "Item 1A: Risk Factors",
          "children": [],
          "start_page": 10,
          "end_page": 15,
          "summary": "3M faces significant global risks including economic volatility, geopolitical tensions (particularly U.S.-China trade conflicts and the Russia-Ukraine war), and supply chain disruptions that impact its operations across 70+ countries where it derives 60% of revenues. The company is also exposed to climate change, public health crises, and unexpected events that increase operational costs and business uncertainty.",
          "node_id": "part_i_item_1a"
        },
        {
          "title": "Item 1B: Unresolved Staff Comments",
          "children": [],
          "start_page": 16,
          "end_page": 16,
          "summary": "3M's Aearo subsidiaries initiated chapter 11 bankruptcy proceedings on July 26, 2022, to establish a company-funded trust addressing liabilities from Combat Arms earplugs and respirator products, while the company simultaneously announced plans to spin off its Health Care business—both transactions carry significant financial, operational, and reputational risks with uncertain outcomes and timelines.",
          "node_id": "part_i_item_1b"
        },
        {
          "title": "Item 2: Properties",
          "children": [],
          "start_page": 16,
          "end_page": 16,
          "summary": "On July 26, 2022, 3M's wholly owned Aearo subsidiaries initiated voluntary Chapter 11 bankruptcy proceedings to establish a trust funded by 3M to address liabilities related to Combat Arms earplugs and respirator products, creating significant legal, operational, and financial risks including uncertain resolution timelines and potential impacts to liquidity and customer relationships. Concurrently, 3M announced plans to spin off its Health Care business into a separate public company, which is contingent upon satisfying multiple conditions including IRS approval and SEC filing, with inherent risks of delays, unexpected costs, and failure to achieve anticipated transaction benefits.",
          "node_id": "part_i_item_2"
        },
        {
          "title": "Item 3: Legal Proceedings",
          "children": [],
          "start_page": 17,
          "end_page": 17,
          "summary": "The company incorporates legal proceedings discussion by reference from Note 16 on Commitments and Contingencies. Under the Dodd-Frank Act Section 1503, the company must disclose mine safety violations and regulatory matters in periodic SEC filings, with detailed information provided in Exhibit 95 of the annual report.",
          "node_id": "part_i_item_3"
        },
        {
          "title": "Item 4: Mine Safety Disclosures",
          "children": [],
          "start_page": 17,
          "end_page": 17,
          "summary": "The company is required under Section 1503 of the Dodd-Frank Act to disclose mine safety violations and regulatory matters in its SEC filings, with the specific information provided in Exhibit 95 of the annual report.",
          "node_id": "part_i_item_4"
        }
      ],
      "start_page": 3,
      "end_page": 3,
      "summary": "This section contains the table of contents and references for Parts I through IV of a Form 10-K filing, including detailed financial notes covering restructuring, income taxes, debt, pension plans, fair value measurements, stock compensation, and business segments (Notes 5-19), along with corporate governance, executive compensation, and accounting items. The document provides comprehensive disclosure of the company's financial condition, internal controls, management structure, and audit information required by SEC regulations.",
      "node_id": "part_i"
    },
    {
      "title": "PART II",
      "children": [
        {
          "title": "Item 5: Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities",
          "children": [],
          "start_page": 18,
          "end_page": 18,
          "summary": "3M had 62,488 shareholders of record as of January 31, 2023, with stock trading on NYSE and other exchanges, while paying quarterly dividends of $1.49 per share in 2022. The company repurchased 10.7 million shares during 2022 at an average price of $134.31 per share under a $10 billion authorization program with no end date, leaving approximately $4.2 billion remaining for future repurchases.",
          "node_id": "part_ii_item_5"
        },
        {
          "title": "Item 7: Management's Discussion and Analysis of Financial Condition and Results of Operations",
          "children": [
            {
              "title": "Overview",
              "children": [],
              "start_page": 19,
              "end_page": 26,
              "summary": "3M, a diversified global manufacturer and technology innovator, reorganized its operating segments into four business units (Safety and Industrial; Transportation and Electronics; Health Care; Consumer) in Q1 2022 and updated its segment reporting metrics, with significant litigation costs of approximately $2.3 billion in 2022. The company's financial performance continues to be materially impacted by COVID-19 pandemic effects on demand and global supply chains, though the diversified business portfolio experiences mixed effects from these disruptions.",
              "node_id": "management_s_discussion_and_analysis_of_financial_condition_and_results_of_operations_overview"
            },
            {
              "title": "Results of Operations",
              "children": [],
              "start_page": 27,
              "end_page": 27,
              "summary": "In 2022, 3M's operating income margin declined to 19.1% from 20.8% due to increased cost of sales (56.2% vs 53.2%) driven by PFAS litigation costs, elevated raw materials and logistics expenses, and manufacturing disruptions in Belgium, partially offset by price increases. SG&A expenses surged 6.1 percentage points of sales, largely due to a $1.2 billion Combat Arms Earplugs litigation charge and PFAS/Russia exit costs, though a $2.7 billion divestiture gain and improved R&D efficiency provided some offsetting benefits.",
              "node_id": "management_s_discussion_and_analysis_of_financial_condition_and_results_of_operations_results_of_operations"
            },
            {
              "title": "Performance by Business Segment",
              "children": [],
              "start_page": 28,
              "end_page": 32,
              "summary": "3M reported a decreased effective tax rate of 9.6% in 2022 compared to 17.8% in 2021, with interest expenses declining due to debt maturities and cash investments. The company operates through four business segments (Safety and Industrial; Transportation and Electronics; Health Care; and Consumer) and updated its segment performance measurement metrics in Q1 2022 to align with how the chief operating decision maker assesses performance and allocates resources.",
              "node_id": "management_s_discussion_and_analysis_of_financial_condition_and_results_of_operations_performance_by_business_segment"
            },
            {
              "title": "Performance by Geographic Area",
              "children": [],
              "start_page": 33,
              "end_page": 33,
              "summary": "3M's Consumer Business (15.5% of consolidated sales) declined 3.9% in 2022 to $5.3 billion, with operating margins compressing 230 basis points to 18.8% due to increased raw material and logistics costs, partially offset by pricing actions and cost discipline. The segment faced headwinds from reduced consumer discretionary spending and retailer inventory reduction, though certain products like Scotch Blue tape and Post-it solutions showed resilience.",
              "node_id": "management_s_discussion_and_analysis_of_financial_condition_and_results_of_operations_performance_by_geographic_area"
            },
            {
              "title": "Critical Accounting Estimates",
              "children": [],
              "start_page": 34,
              "end_page": 35,
              "summary": "3M's workforce declined from 95,000 to 92,000 employees in 2022 with capital spending of $9.2 billion across operations; critical accounting estimates include complex legal proceeding assessments, pension/postretirement obligations requiring discount rate assumptions, and property/plant/equipment valuations that materially impact financial statements and require management judgment on inherently uncertain future events.",
              "node_id": "management_s_discussion_and_analysis_of_financial_condition_and_results_of_operations_critical_accounting_estimates"
            },
            {
              "title": "New Accounting Pronouncements",
              "children": [],
              "start_page": 36,
              "end_page": 36,
              "summary": "3M conducts goodwill impairment testing at 21 reporting units using market comparables and discounted cash flow analyses, with no impairment indicated in the 2022 annual test; however, 3M recorded goodwill and long-lived asset impairment charges related to Advanced Materials and Electronics Materials Solutions divisions following its December 2022 commitment to exit PFAS manufacturing.",
              "node_id": "management_s_discussion_and_analysis_of_financial_condition_and_results_of_operations_new_accounting_pronouncements"
            },
            {
              "title": "Financial Condition and Liquidity",
              "children": [],
              "start_page": 37,
              "end_page": 41,
              "summary": "3M maintains a strong liquidity profile with a $5 billion commercial paper program capacity and access to capital markets, supported by an A1 credit rating from Moody's (stable outlook) and ongoing staggered debt maturity management. The company prioritizes organic growth investment and shareholder returns through dividends and buybacks, with total debt decreased in 2022 through $1.1 billion in repayments, demonstrating financial flexibility to deploy capital across strategic priorities while managing LIBOR transition obligations.",
              "node_id": "management_s_discussion_and_analysis_of_financial_condition_and_results_of_operations_financial_condition_and_liquidity"
            },
            {
              "title": "Financial Instruments",
              "children": [],
              "start_page": 42,
              "end_page": 42,
              "summary": "3M uses foreign exchange derivatives ($3.2B designated hedges, $2.8B undesignated), interest rate swaps, and supply contracts to manage currency, interest rate, and commodity price risks, with counterparty credit exposure limited to fair value and monitored through major international financial institutions.",
              "node_id": "management_s_discussion_and_analysis_of_financial_condition_and_results_of_operations_financial_instruments"
            }
          ],
          "start_page": 19,
          "end_page": 26,
          "summary": "3M is a diversified global manufacturer reorganized into four operating segments effective Q1 2022, with MD&A covering eight sections including results of operations and financial condition; the company faced significant challenges in 2022 from COVID-19 supply chain disruptions and approximately $2.3 billion in litigation costs, while its diversified business portfolio creates mixed pandemic impacts across different product lines.",
          "node_id": "part_ii_item_7"
        },
        {
          "title": "Item 7A: Quantitative and Qualitative Disclosures About Market Risk",
          "children": [],
          "start_page": 42,
          "end_page": 42,
          "summary": "3M manages significant market risks through financial instruments including $3.2 billion in foreign exchange derivatives designated as hedges and $2.8 billion in non-designated contracts, along with interest rate swaps and commodity price agreements, with oversight by senior management to mitigate impacts from currency fluctuations, interest rate changes, and commodity price volatility on operations and financial condition.",
          "node_id": "part_ii_item_7a"
        },
        {
          "title": "Item 8: Financial Statements and Supplementary Data",
          "children": [
            {
              "title": "Index to Financial Statements",
              "children": [],
              "start_page": 43,
              "end_page": 43,
              "summary": "3M's 2022 Value at Risk analysis using Monte Carlo simulation revealed potential adverse impacts to after-tax earnings of $315 million from foreign exchange rate changes, $18 million from interest rate changes, and $5 million from commodity price changes at a 95% confidence level. Additionally, the company faces significant commodity exposures where a 1% price change in purchased components/materials could result in $85 million pre-tax cost/savings annually, and a 10% change in global energy prices could impact pre-tax results by approximately $45 million per year.",
              "node_id": "financial_statements_and_supplementary_data_index_to_financial_statements"
            },
            {
              "title": "Management's Responsibility for Financial Reporting",
              "children": [],
              "start_page": 44,
              "end_page": 44,
              "summary": "3M's management is responsible for maintaining a system of internal control over financial reporting designed to safeguard assets and ensure accurate financial statements prepared in accordance with GAAP standards. As of December 31, 2022, management assessed the internal control system using the COSO framework and concluded it is effective, with independent auditor PricewaterhouseCoopers LLP providing an unqualified opinion supporting this assessment.",
              "node_id": "financial_statements_and_supplementary_data_management_s_responsibility_for_financial_reporting"
            },
            {
              "title": "Management's Report on Internal Control Over Financial Reporting",
              "children": [],
              "start_page": 44,
              "end_page": 44,
              "summary": "3M Company's management affirms responsibility for maintaining effective internal control over financial reporting and confirmed as of December 31, 2022, that the system is effective based on the COSO framework assessment. PricewaterhouseCoopers LLP independently audited and issued an unqualified opinion confirming the effectiveness of 3M's internal controls over financial reporting.",
              "node_id": "financial_statements_and_supplementary_data_management_s_report_on_internal_control_over_financial_reporting"
            },
            {
              "title": "Report of Independent Registered Public Accounting Firm",
              "children": [],
              "start_page": 45,
              "end_page": 47,
              "summary": "The independent auditors issued unqualified opinions that 3M Company's consolidated financial statements for the three-year period ended December 31, 2022 fairly present the company's financial position in accordance with U.S. GAAP, and that the company maintained effective internal control over financial reporting as of December 31, 2022. The audit was conducted in accordance with PCAOB standards, with procedures designed to detect material misstatements due to error or fraud.",
              "node_id": "financial_statements_and_supplementary_data_report_of_independent_registered_public_accounting_firm"
            },
            {
              "title": "Consolidated Statement of Income for years ended December 31, 2022, 2021 and 2020",
              "children": [],
              "start_page": 48,
              "end_page": 48,
              "summary": "3M Company's net sales declined 3.2% to $34.2 billion in 2022 from $35.4 billion in 2021, driven by higher operating expenses and goodwill impairment charges of $271 million, resulting in net income attributable to 3M of $5.8 billion (diluted EPS of $10.18) compared to $5.9 billion in 2021. The company recognized a $2.7 billion gain on business divestitures in 2022, but this was offset by increased operating expenses and reduced operating income to $6.5 billion, signaling operational headwinds despite portfolio optimization efforts.",
              "node_id": "financial_statements_and_supplementary_data_consolidated_statement_of_income_for_years_ended_december_31_2022_2021_and_2020"
            },
            {
              "title": "Consolidated Statement of Comprehensive Income for the years ended December 31, 2022, 2021 and 2020",
              "children": [],
              "start_page": 49,
              "end_page": 49,
              "summary": "3M reported net income of $5.8 billion in 2022, relatively flat compared to 2021, with comprehensive income declining to $5.9 billion as favorable pension adjustments ($915M) were offset by unfavorable currency translation losses ($893M). The company's year-over-year comprehensive income declined 15% from 2021's $6.9 billion, primarily driven by reduced other comprehensive income benefits due to weaker pension gains and adverse foreign exchange impacts.",
              "node_id": "financial_statements_and_supplementary_data_consolidated_statement_of_comprehensive_income_for_the_years_ended_december_31_2022_2021_and_2020"
            },
            {
              "title": "Consolidated Balance Sheet at December 31, 2022 and 2021",
              "children": [],
              "start_page": 50,
              "end_page": 50,
              "summary": "3M Company's total assets decreased from $47.1 billion in 2021 to $46.5 billion in 2022, driven by reductions in cash, goodwill, and intangible assets, while total liabilities remained relatively stable at $31.7 billion. The company's shareholder equity declined modestly to $14.7 billion, reflecting reduced retained earnings and increased treasury stock, indicating the company faced asset contraction and modest deleveraging during the period.",
              "node_id": "financial_statements_and_supplementary_data_consolidated_balance_sheet_at_december_31_2022_and_2021"
            },
            {
              "title": "Consolidated Statement of Changes in Equity for the years ended December 31, 2022, 2021 and 2020",
              "children": [],
              "start_page": 51,
              "end_page": 51,
              "summary": "3M Company's total shareholder equity grew from $10.1 billion (December 2019) to $14.8 billion (December 2022), driven by cumulative net income of $17.2 billion across the period, partially offset by $10.2 billion in dividends paid and $5.1 billion in share repurchases. In 2022, the company recorded net income of $5.8 billion, declared dividends of $5.96 per share, and executed a split-off of its Food Safety business, which reduced equity by $2.0 billion.",
              "node_id": "financial_statements_and_supplementary_data_consolidated_statement_of_changes_in_equity_for_the_years_ended_december_31_2022_2021_and_2020"
            },
            {
              "title": "Consolidated Statement of Cash Flows for the years ended December 31, 2022, 2021 and 2020",
              "children": [],
              "start_page": 52,
              "end_page": 52,
              "summary": "3M's operating cash flow decreased to $5.6 billion in 2022 from $7.5 billion in 2021, driven by higher inventory investments and lower accounts payable changes, while the company deployed capital through $3.4 billion in dividend payments and $1.5 billion in share repurchases, reducing cash reserves by $909 million to $3.7 billion. Key business implications include tightening liquidity, increased working capital requirements, and continued shareholder returns despite operational cash generation headwinds.",
              "node_id": "financial_statements_and_supplementary_data_consolidated_statement_of_cash_flows_for_the_years_ended_december_31_2022_2021_and_2020"
            },
            {
              "title": "Notes to Consolidated Financial Statements",
              "children": [
                {
                  "title": "Item 1: Significant Accounting Policies",
                  "children": [],
                  "start_page": 53,
                  "end_page": 58,
                  "summary": "3M Company consolidates all applicable subsidiaries while eliminating intercompany transactions and deconsolidated the Aearo Entities in Q3 2022. The company changed its segment operating performance measurement and foreign currency translation methods in 2022, with local currencies generally treated as functional currencies outside the U.S., except for Argentina and Turkey which are remeasured using their parent currency due to highly inflationary economies.",
                  "node_id": "notes_to_consolidated_financial_statements_item_1"
                },
                {
                  "title": "Item 2: Revenue",
                  "children": [],
                  "start_page": 59,
                  "end_page": 60,
                  "summary": "3M reported total net sales of $34.2 billion in 2022, declining from $35.4 billion in 2021, with significant contributions from Safety and Industrial ($11.6B), Transportation and Electronics ($8.9B), and Health Care ($8.4B) segments. The company generates substantial recurring revenue from operating leases on medical devices ($577M annually) and deferred software license revenue (~$500M recognized in 2022), with Americas representing the largest geographic market at $18.4 billion in sales.",
                  "node_id": "notes_to_consolidated_financial_statements_item_2"
                },
                {
                  "title": "Item 3: Acquisitions and Divestitures",
                  "children": [],
                  "start_page": 61,
                  "end_page": 62,
                  "summary": "3M completed no acquisitions in 2020-2022 but executed major divestitures, including the September 2022 split-off of its Food Safety Division to Neogen Corporation for $2.8 billion in aggregate consideration (generating a $2.7 billion pre-tax gain), structured as a Reverse Morris Trust to be tax-efficient, plus announced July 2022 plans to spin off the Health Care business as a separate public company by end-2023 while retaining a 9.9% initial ownership stake.",
                  "node_id": "notes_to_consolidated_financial_statements_item_3"
                },
                {
                  "title": "Item 4: Goodwill and Intangible Assets",
                  "children": [],
                  "start_page": 63,
                  "end_page": 63,
                  "summary": "3M's goodwill balance decreased from $13.5 billion (2021) to $12.8 billion (2022) due to a $271 million impairment in the Industrial segment and a $300 million impairment charge related to the Advanced Materials unit's PFAS manufacturing exit, partially offset by foreign currency translation impacts. Intangible assets decreased to $4.7 billion from $5.3 billion, driven by ongoing amortization of customer relationships, patents, and technology-based assets across the company's portfolio.",
                  "node_id": "notes_to_consolidated_financial_statements_item_4"
                },
                {
                  "title": "Item 5: Restructuring Actions",
                  "children": [],
                  "start_page": 64,
                  "end_page": 66,
                  "summary": "3M underwent restructuring actions from 2020-2022 that eliminated approximately 3,100 positions worldwide with a total pre-tax charge of ~$280 million, aimed at enhancing operations and marketing capabilities while de-prioritizing slower-growth markets. Additionally, in December 2022, 3M recorded impairment charges related to its commitment to exit PFAS manufacturing, with amortization expense declining from $537 million in 2020 to $498 million in 2022.",
                  "node_id": "notes_to_consolidated_financial_statements_item_5"
                },
                {
                  "title": "Item 6: Supplemental Income Statement Information",
                  "children": [],
                  "start_page": 67,
                  "end_page": 67,
                  "summary": "In Q2 2020, the company approved restructuring actions affecting approximately 400 positions worldwide and resulting in a $58 million pre-tax charge, primarily driven by COVID-19 impacts, with charges distributed across cost of sales ($13M), SG&A ($37M), and R&D ($8M). By Q2 2021, most restructuring activities were completed with $11 million remaining accrued liabilities as of March 31, 2021.",
                  "node_id": "notes_to_consolidated_financial_statements_item_6"
                },
                {
                  "title": "Item 7: Supplemental Balance Sheet Information",
                  "children": [],
                  "start_page": 68,
                  "end_page": 68,
                  "summary": "In 2022, the company's net property, plant and equipment decreased slightly from $9,429M to $9,178M despite $1,728M in construction in progress, while other liabilities increased significantly to $5,615M (primarily due to $2,179M in contingent liability claims), with $2.1B in deconsolidated Aearo Entities liabilities and $0.7B in associated investments impacting the balance sheet.",
                  "node_id": "notes_to_consolidated_financial_statements_item_7"
                },
                {
                  "title": "Item 8: Supplemental Equity and Comprehensive Income Information",
                  "children": [],
                  "start_page": 69,
                  "end_page": 69,
                  "summary": "3M declared and paid annual dividends of $5.96, $5.92, and $5.88 per share in 2022, 2021, and 2020 respectively, with 944 million shares issued as of December 31, 2022. The company's accumulated other comprehensive loss improved to $6.673 billion at year-end 2022 from $6.750 billion in 2021, primarily driven by $915 million net-of-tax gains in pension and postretirement plan adjustments.",
                  "node_id": "notes_to_consolidated_financial_statements_item_8"
                },
                {
                  "title": "Item 9: Supplemental Cash Flow Information",
                  "children": [],
                  "start_page": 70,
                  "end_page": 70,
                  "summary": "3M reclassified $275 million (net of tax) out of Accumulated Other Comprehensive Income in 2022, primarily driven by $350 million in net pension and postretirement plan adjustments, partially offset by $75 million in gains from cash flow hedging instruments. The company paid $1,320 million in net cash income taxes and $440 million in cash interest payments during 2022.",
                  "node_id": "notes_to_consolidated_financial_statements_item_9"
                },
                {
                  "title": "Item 10: Income Taxes",
                  "children": [],
                  "start_page": 71,
                  "end_page": 73,
                  "summary": "The company reported total income before taxes of $6.4 billion in 2022 (down from $7.2 billion in 2021) with a total income tax provision of $612 million, resulting in an effective tax rate of 9.6% (compared to 17.8% in 2021), primarily benefiting from the tax-efficient structure of the Food Safety business divestiture. Net deferred tax assets increased to $400 million in 2022, with significant deferred tax liabilities related to intangible assets ($901 million) and accelerated depreciation ($586 million).",
                  "node_id": "notes_to_consolidated_financial_statements_item_10"
                },
                {
                  "title": "Item 11: Marketable Securities",
                  "children": [],
                  "start_page": 74,
                  "end_page": 74,
                  "summary": "3M held $261 million in total marketable securities as of December 31, 2022 (up from $228 million in 2021), comprising primarily commercial paper ($213 million) and certificates of deposit, with 91% maturing within one year. The company also maintains $16.0 billion in undistributed foreign earnings, of which $8.0 billion is indefinitely reinvested with no deferred tax provision, and realized $170 million in tax benefits from reduced foreign tax rates in China, Switzerland, Brazil, and Singapore.",
                  "node_id": "notes_to_consolidated_financial_statements_item_11"
                },
                {
                  "title": "Item 12: Long-Term Debt and Short-Term Borrowings",
                  "children": [],
                  "start_page": 75,
                  "end_page": 76,
                  "summary": "As of December 31, 2022, the company maintained total long-term debt of $15.9 billion (down from $17.3 billion in 2021), with approximately 93% in fixed-rate debt at an effective rate of 2.93% and 7% in floating-rate debt at 5.70%, reflecting a diversified debt portfolio across multiple currencies and maturity dates extending to 2050. The company repaid $1.2 billion in medium-term notes during 2022 and has $1.9 billion classified as current portion of long-term debt due within one year.",
                  "node_id": "notes_to_consolidated_financial_statements_item_12"
                },
                {
                  "title": "Item 13: Pension and Postretirement Benefit Plans",
                  "children": [],
                  "start_page": 77,
                  "end_page": 86,
                  "summary": "3M issued $1.75 billion in fixed-rate notes in March 2020 and subsequently converted $800 million of debt into floating rate through interest rate swaps in 2021, while repaying approximately $3+ billion in maturing debt across 2020-2022 with minimal early extinguishment charges. The company maintains over 75 defined benefit pension plans across 28 countries covering substantially all U.S. employees and many international employees.",
                  "node_id": "notes_to_consolidated_financial_statements_item_13"
                },
                {
                  "title": "Item 14: Derivatives",
                  "children": [],
                  "start_page": 87,
                  "end_page": 91,
                  "summary": "3M uses derivative instruments including interest rate swaps, currency swaps, and forward/option contracts to manage foreign exchange and interest rate risks, with gains and losses on cash flow hedges recorded in other comprehensive income and reclassified to earnings when the hedged transactions occur. The company's international pension plans' Level 3 assets decreased $66 million in 2022 ($51 million in 2021) due to net purchases, unrealized losses, and adverse currency exchange rate movements, primarily from insurance contracts valued at cash surrender values.",
                  "node_id": "notes_to_consolidated_financial_statements_item_14"
                },
                {
                  "title": "Item 15: Fair Value Measurements",
                  "children": [],
                  "start_page": 92,
                  "end_page": 93,
                  "summary": "3M's derivative assets and liabilities subject to master netting agreements totaled $217 million and $142 million respectively in 2022, with net amounts of $177 million and $102 million after offsetting eligible liabilities and assets. Foreign currency hedging activities resulted in a $127 million pre-tax income benefit in 2022, while 3M values financial instruments at fair value using market-based and income approaches, with derivatives and available-for-sale securities comprising the primary recurring fair value measurements.",
                  "node_id": "notes_to_consolidated_financial_statements_item_15"
                },
                {
                  "title": "Item 16: Commitments and Contingencies",
                  "children": [],
                  "start_page": 94,
                  "end_page": 115,
                  "summary": "In 2022, 3M recorded significant asset impairments of $0.9 billion ($109M for Russia exit and $0.8B for PFAS manufacturing exit by 2025), primarily reflecting charges for long-lived assets ($0.5B), goodwill ($0.3B), and cumulative translation adjustments. The company measures pension plan assets and certain impaired assets at fair value on a nonrecurring basis, with long-term debt fair values estimated using third-party quotes, showing a $14.0B carrying value versus $12.5B fair value as of December 31, 2022.",
                  "node_id": "notes_to_consolidated_financial_statements_item_16"
                },
                {
                  "title": "Item 17: Leases",
                  "children": [],
                  "start_page": 116,
                  "end_page": 117,
                  "summary": "In 2022, 3M recorded total net lease costs of $447 million (down from $463 million in 2021), comprising $295 million in operating lease costs and $152 million in finance lease costs and variable expenses, with operating lease right-of-use assets of $829 million and total lease liabilities of $927 million. The company's weighted average remaining lease term for operating leases is 5.5 years at a 2.2% discount rate, indicating manageable and declining lease obligations with immaterial impact on consolidated results.",
                  "node_id": "notes_to_consolidated_financial_statements_item_17"
                },
                {
                  "title": "Item 18: Stock-Based Compensation",
                  "children": [],
                  "start_page": 118,
                  "end_page": 120,
                  "summary": "As of December 31, 2022, 3M recognized $263 million in stock-based compensation expense across stock options, restricted stock, and RSUs, with 32 million shares remaining available for grant under the Long-Term Incentive Plan and 8,357 participants holding outstanding awards. The company's expense recognition is accelerated due to its non-substantive vesting approach for retiree-eligible employees (age 55+ with 10+ years of service), representing 36% of annual grant-related compensation costs.",
                  "node_id": "notes_to_consolidated_financial_statements_item_18"
                },
                {
                  "title": "Item 19: Business Segments and Geographic Information",
                  "children": [],
                  "start_page": 121,
                  "end_page": 124,
                  "summary": "3M operates four business segments (Safety and Industrial, Transportation and Electronics, Health Care, and Consumer) organized by markets, products, and technologies, with plans to spin off Health Care as a separate company in July 2022. Effective Q1 2022, 3M updated its segment performance metrics to eliminate dual credit reporting and align with how the chief operating decision maker assesses performance and allocates resources, with these changes applied retroactively to all presented periods.",
                  "node_id": "notes_to_consolidated_financial_statements_item_19"
                }
              ],
              "start_page": 53,
              "end_page": 58,
              "summary": "3M Company, a diversified global manufacturer and technology innovator, deconsolidated the Aearo Entities in Q3 2022 and implemented changes to its segment operating performance measures in Q1 2022, which affected reported segment profit/loss and disaggregated revenue for all periods presented. The company applies U.S. generally accepted accounting principles with management estimates that consider COVID-19 impacts and inflationary pressures in certain foreign markets like Turkey and Argentina.",
              "node_id": "financial_statements_and_supplementary_data_notes_to_consolidated_financial_statements"
            }
          ],
          "start_page": 43,
          "end_page": 43,
          "summary": "3M conducts annual Value at Risk analysis using Monte Carlo simulations at a 95% confidence level, showing foreign exchange exposure as the primary risk with potential adverse after-tax earnings impact of $315 million in 2022 (up from $140 million in 2021), while commodity price sensitivity analysis indicates that a 1% change in purchased components/materials costs could impact pre-tax earnings by approximately $85 million annually. The company faces significant global supply chain and energy cost exposure, with a 10% energy price change potentially affecting pre-tax earnings by $45 million per year.",
          "node_id": "part_ii_item_8"
        },
        {
          "title": "Item 9: Changes in and Disagreements with Accountants on Accounting and Financial Disclosure",
          "children": [],
          "start_page": 125,
          "end_page": 125,
          "summary": "The company reported no disagreements with accountants on accounting and financial disclosure. Management and the CEO/CFO concluded that disclosure controls and procedures are effective as of the report period, with PricewaterhouseCoopers LLP providing an unqualified audit opinion on the company's internal control over financial reporting as of December 31, 2022.",
          "node_id": "part_ii_item_9"
        },
        {
          "title": "Item 9A: Controls and Procedures",
          "children": [],
          "start_page": 125,
          "end_page": 125,
          "summary": "As of December 31, 2022, the Company's disclosure controls and procedures and internal control over financial reporting are both effective, with an unqualified opinion from PricewaterhouseCoopers LLP, and no material changes were identified during the fiscal quarter. The Company is implementing a worldwide ERP system in phases over several years to improve financial process efficiency, with initial implementations completed in select subsidiaries and U.S. locations without materially affecting internal control effectiveness.",
          "node_id": "part_ii_item_9a"
        },
        {
          "title": "Item 9B: Other Information",
          "children": [],
          "start_page": 125,
          "end_page": 125,
          "summary": "The Company's disclosure controls and procedures and internal control over financial reporting are effective as of December 31, 2022, with PricewaterhouseCoopers LLP providing an unqualified audit opinion; the Company is implementing a phased enterprise resource planning system worldwide expected to improve financial transaction efficiency, with no material adverse effects on internal controls reported to date. Additionally, 3M holds intellectual property patents and trademarks in Iran and obtained an OFAC-specific license in January 2022 to make renewal fee payments to the Iran Intellectual Property Office.",
          "node_id": "part_ii_item_9b"
        },
        {
          "title": "Item 9C: Disclosure Regarding Foreign Jurisdictions that Prevent Inspections",
          "children": [],
          "start_page": 125,
          "end_page": 125,
          "summary": "The company's disclosure controls and procedures, as well as internal control over financial reporting, were evaluated and deemed effective as of December 31, 2022, with PricewaterhouseCoopers LLP providing an unqualified audit opinion. Additionally, 3M obtained an OFAC specific license in January 2022 to make patent and trademark renewal payments in Iran through intermediaries, constituting compliance-related activity under the Iran Threat Reduction and Syria Human Rights Act.",
          "node_id": "part_ii_item_9c"
        }
      ],
      "start_page": 18,
      "end_page": 18,
      "summary": "3M had 62,488 shareholders of record as of January 31, 2023, with its stock listed on NYSE and other exchanges, while declaring quarterly cash dividends of $1.49 and $1.48 per share in 2022 and 2021 respectively. During 2022, 3M repurchased 10.7 million shares for $1.4 billion under its $10 billion authorization program, with approximately $4.2 billion remaining available for future repurchases.",
      "node_id": "part_ii"
    },
    {
      "title": "PART III",
      "children": [
        {
          "title": "Item 10: Directors, Executive Officers and Corporate Governance",
          "children": [],
          "start_page": 126,
          "end_page": 126,
          "summary": "3M incorporates information about its board of directors, executive officers, corporate governance, and executive compensation from its proxy statement (filed May 9, 2023 annual meeting) into this Form 10-K, and maintains a code of ethics applicable to all employees including executive officers that is publicly available on its website.",
          "node_id": "part_iii_item_10"
        },
        {
          "title": "Item 11: Executive Compensation",
          "children": [],
          "start_page": 126,
          "end_page": 126,
          "summary": "3M incorporates its proxy statement by reference for executive compensation disclosure, requiring all employees including C-suite officers to comply with the company's code of ethics; detailed compensation information for executives and directors, along with compensation committee reports, is contained in the May 9, 2023 proxy statement.",
          "node_id": "part_iii_item_11"
        },
        {
          "title": "Item 12: Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters",
          "children": [],
          "start_page": 127,
          "end_page": 127,
          "summary": "As of December 31, 2022, 3M had 38.5 million securities outstanding under equity compensation plans with 52.6 million securities remaining available for future issuance, including 35.5 million stock options with a weighted-average exercise price of $166.97. The company's equity compensation structure comprises stock options, restricted stock units, performance shares, and non-employee director deferred stock units, reflecting a comprehensive incentive program for management and non-employee directors.",
          "node_id": "part_iii_item_12"
        },
        {
          "title": "Item 13: Certain Relationships and Related Transactions, and Director Independence",
          "children": [],
          "start_page": 127,
          "end_page": 127,
          "summary": "As of December 31, 2022, 3M had 38.5 million securities authorized for issuance under equity compensation plans (including 35.5 million stock options with a weighted-average exercise price of $166.97) with 52.6 million securities remaining available for future issuance. No related-party transactions requiring disclosure were identified, with corporate governance and director independence policies detailed in the 3M Proxy Statement.",
          "node_id": "part_iii_item_13"
        },
        {
          "title": "Item 14: Principal Accounting Fees and Services",
          "children": [],
          "start_page": 127,
          "end_page": 127,
          "summary": "As of December 31, 2022, 3M had 38.5 million securities to be issued under equity compensation plans (including 35.5 million stock options with a weighted-average exercise price of $166.97) with 52.6 million securities remaining available for future issuance. The company's equity compensation plans are approved by security holders and include stock options, restricted stock units, performance shares, and non-employee director deferred stock units, with detailed audit committee oversight of accounting fees and services disclosed in the Proxy Statement.",
          "node_id": "part_iii_item_14"
        }
      ],
      "start_page": 126,
      "end_page": 126,
      "summary": "3M's Form 10-K incorporates by reference sections of its proxy statement filed for the May 9, 2023 annual meeting, covering directors, executive officers, corporate governance, and executive compensation details. The company maintains a code of ethics applicable to all employees and executives, publicly available on its website.",
      "node_id": "part_iii"
    },
    {
      "title": "PART IV",
      "children": [
        {
          "title": "Item 15: Exhibits, Financial Statement Schedules",
          "children": [],
          "start_page": 128,
          "end_page": 129,
          "summary": "3M's Part IV Item 15 discloses that consolidated financial statements are filed in the report index, financial statement schedules are omitted as they are not required or are included in the main statements, and exhibits include articles of incorporation, debt indentures, and various management compensation plans and awards under the 2016 Long-Term Incentive Plan, all incorporated by reference from prior SEC filings.",
          "node_id": "part_iv_item_15"
        },
        {
          "title": "Item 16: Form 10-K Summary",
          "children": [],
          "start_page": 130,
          "end_page": 252,
          "summary": "This section contains the formal filing exhibits and signatures for 3M Company's Form 10-K, including certifications from the CEO and CFO under the Sarbanes-Oxley Act, subsidiary disclosures, XBRL data files, and director signatures as of February 8, 2023, along with a reference to the 2016 Long-Term Incentive Plan performance share award agreement. The document provides compliance documentation and corporate governance evidence required for public company SEC filings.",
          "node_id": "part_iv_item_16"
        }
      ],
      "start_page": 128,
      "end_page": 129,
      "summary": "Part IV Item 15 outlines 3M's exhibits and financial statement schedules, including consolidated financial statements indexed at the document's beginning and omitted schedules due to lack of required conditions or material subsidiaries. The section lists key exhibits incorporating by reference 3M's Articles of Incorporation, Bylaws, debt indentures, and multiple Long-Term Incentive Plan documents governing employee and director compensation through stock options, restricted stock units, and performance shares.",
      "node_id": "part_iv"
    }
  ],
  "summary": "3M_2022_10K containing: PART I, PART II, PART III, PART IV.",
  "node_id": "root"
}